INV_KD = 20 #КД между инвайтами
ERR_KD = 20 #КД если юзер гнида ебаная
CH_FROM = "https://t.me/programrus" #Ссылка на чат откуда тащить юзеров
CH_TO = "https://t.me/goodnewsrussia1" #Ccылка на чат куда тащить юзеров
CHECK_TIMEOUT = False #False - Не ожидать таймаут \ True - Ожидать таймаут
INV_CNT = 40 #Количество инвайтов перед переходом в режим ожидания
PROXY_ENABLED = True
PROXY_IPS = ["172.67.3.96:80",
             "172.67.181.102:80",
             "203.30.188.43:80",
             "203.23.106.121:80",
             "203.30.189.179:80",
             "203.32.120.110:80",
             "45.8.105.176:80",
             "203.28.9.199:80",
             "203.23.104.96:80",
             "203.24.102.238:80",
             "203.28.9.52:80",
             "203.23.106.198:80",
             "203.30.188.217:80",
             "162.247.243.142:80",
             "172.67.120.209:80",
             "191.101.251.57:80",
             "172.64.173.27:80",
             "185.162.231.224:80"]
